simplecodecasts_saas/app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("comments", "created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comments", "test 1"], ["created_at", "2016-11-23 17:53:55.433594"], ["email", "test 1"], ["name", "Test 1"], ["updated_at", "2016-11-23 17:53:55.433594"]]
---
    def create
        @contact = Contact.new(contact_params)

        if @contact.save