app/controllers/profiles_controller.rb

    def new
        # form where a user can fill out their own profile
    @user = User.find( params[:user_id] )
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1

    def create
        @user = User.find ( params[:user_id] )
        @profile = @user.build_profile(profile_params)
        if @profile.save
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "profiles" ("contact_email", "created_at", "description", "first_name", "job_title", "last_name", "phone_number", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "profiles" SET "updated_at" = ?, "user_id" = ? WHERE "profiles"."id" = 1  [["updated_at", "2017-01-15 20:48:41.395692"], ["user_id", nil]]